# GetMacroModuleIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MacroModule..::..GetMacroModuleIterator Method
MacroModule Class See Also
---
Returns a Macro module iterator that iterates through the collection.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public MacroModuleIterator GetMacroModuleIterator()
```

Visual Basic
---
```text
Public Function GetMacroModuleIterator As MacroModuleIterator
```

Visual C++
---
```text
public:
MacroModuleIterator^ GetMacroModuleIterator()
```

# ### Return Value
A Macro module iterator object that can be used to iterate through key-value pairs in the collection.
# See Also
MacroModule Class
Autodesk.Revit.DB.Macros Namespace